# Erlang - Lekcja 1
2025y. Franciszek Kaniewski, UMK

## 1. Zalety erlanga
- Filozofia <b>Let is crash</b>
- SkalowalnoÅ›Ä‡
- Prostota dystybucji
- ResponsywnoÅ›Ä‡
- <b>Hot code swapping</b>
- <b>Eliksir</b>

[WiÄ™cej tutaj ğŸ˜€](https://favtutor.com/articles/whatsapp-discord-and-the-secret-to-handling-millions-of-concurrent-users/)

## 2. Shell
W Erlangu REPL(Readâ€“Evalâ€“Print Loop) nazywa siÄ™ powÅ‚okÄ… Erlanga i uruchamia siÄ™ jÄ… komendÄ…:
```
erl
```
przykÅ‚ad:
```
1> 2 + 3.
5
2> lists:reverse([1,2,3]).
[3,2,1]
```
### NajwaÅ¼niejsze polecenia w powÅ‚oce
`q().` - WyjÅ›cie z powÅ‚oki  
`help().` - Lista komend    
`h()` - WyÅ›wietla ostatnie 20 poleceÅ„ z konsoli   
`c(Module).` - Kompiluje moduÅ‚ Module.erl w bieÅ¼Ä…cym katalogu   
`l(Module).` - PrzeÅ‚adowuje moduÅ‚   
`f().` - CzyÅ›ci wszystkie zmienne z powÅ‚oki    
`f(x).` - CzyÅ›ci tylko zmiennÄ… X    
`i().` - Listuje dziaÅ‚ajÄ…ce procesy    
`regs().` - Listuje zarejestrowane procesy  
`halt().` - Twarde wyjÅ›cie bez cleanup  

### Flagi uruchomieniowe powÅ‚oki
`erl -s Module Function` - Uruchamia funkcjÄ™ po starcie 
`erl -pa Path` - Dodaje Å›cieÅ¼kÄ™ do kodu (np. /ebin)     
`erl -noshell` - Uruchamia bez interaktywnej powÅ‚oki    
`erl -detached` - Uruchamia w tle jak usÅ‚ugÄ™    
`erl -name node@host` - WÅ‚Ä…cza tryb rozproszony (nazwa wÄ™zÅ‚a)   

## 3. Zmienne
 - Single assigment
 ```
 A = 20.

 A = 10. % **exception error: no match of right hand side value 10
 A = A + 1. % **exception error: no match of right hand side value 21
 ```
 - Integers:    
    - `10 ` 
    - `-234  `  
	- `16#AB10F`    
	- `2#110111010`     
	- `$A`  - Kod ASCII
- Floats
	 - `17.368`
	 - `-56.654` 
	 - `12.34E-10.`
 ```
1> 10 / 3.
3.3333333333333335

2> 10 dim 3.
3

3> 10 rem 3.
1
 ```
## Atom
Atom to etykieta lub symbol â€“ coÅ›, co nazywa rzecz, stan lub typ, ale nie przechowuje danych jak string czy liczba, tylko adres.     
Jest niezmienny i unikalny w caÅ‚ym programie.   
MoÅ¼na go uÅ¼ywaÄ‡ do oznaczania statusÃ³w, typÃ³w wiadomoÅ›ci, kluczy w mapach.  
CoÅ› jak Enum.       

Deklaracja:
```
1> ok.
ok

2> start_with_a_lower_case_letter.
start_with_a_lower_case_letter

3> 'MÃ³j Atom! !#@$%^ \n' %JeÅ›li chcemy zaczÄ…Ä‡ z wielkiej litery i/lub mieÄ‡ znaki speclane/biaÅ‚e.
'MÃ³j Atom! !#@$%^ \n'
```

## Tuples
Krotka(Tuple) to zbiÃ³r elementÃ³w umieszczonych razem w jednym obiekcie.     
Elementy mogÄ… byÄ‡ rÃ³Å¼nych typÃ³w (liczby, stringi, atomy, listy, krotki).    
Krotki majÄ… staÅ‚Ä… dÅ‚ugoÅ›Ä‡ i sÄ… indeksowane od 1.    

```
T1 = {1, 2, 3}.               % tylko liczby
T2 = {ok, 42, "hello"}.       % atom + liczba + string
T3 = {{1,2}, [3,4], "Erlang"}. % krotka zawiera listÄ™ i innÄ… krotkÄ™
```
WyciÄ…ganie danych z Tuples  

- funkcja element:
```
1> Student1 = {student, 1, "Jan", "Kowalski", 4.5, [4,4,4,5,5,5]}.
{student,1,"Jan","Kowalski",4.5,[4,4,4,5,5,5]}

2> element(1, Student1).
student

3> element(4, Student1).
"Kowalski"
```

 - przypisanie do zmiennych:
```
{DataTypeAtom,Id,Name,Surrname,AVG,Marks} = Student1. % DataTypeAtom = student, Id = 1, Name = "Jan", itd...
{student,1,"Jan","Kowalski",4.5,[4,4,4,5,5,5]}

{student,_,_,_,_,Student1Marks} = Student1. % Student1Marks = [4,4,4,5,5,5]
{student,1,"Jan","Kowalski",4.5,[4,4,4,5,5,5]}
```

## Listy
Lista w Erlangu to uporzÄ…dkowana kolekcja elementÃ³w dowolnego typu, zapisana w nawiasach kwadratowych [], w ktÃ³rej elementy moÅ¼na Å‚atwo dodawaÄ‡ na poczÄ…tek i przetwarzaÄ‡ za pomocÄ… pattern matchingu.		

MogÄ… przechowywaÄ‡ dowolne typy danych.  
MogÄ… byÄ‡ puste: [].  
MajÄ… Å‚atwy dostÄ™p do pierwszego elementu (Head) i reszty (Tail) â€“ dziÄ™ki pattern matchingowi.  

```
1> [1,2,3,4,5].
[1,2,3,4,5]

2> [{person, "Jan","Kowalski"},{person, "Kamil","Kowalski"}, 3, atom].
[{person, "Jan","Kowalski"},{person, "Kamil","Kowalski"}, 3, atom]
```

WyciÄ…ganie danych z Listy

```
1> List = [1,2,3,4].
[1,2,3,4]

2> [Head | Tail] = List. % Head = 1, Tail = [2,3,4]
[1,2,3,4]

3> [One, Two, Tree, Four | R] = List. %  One = 1, Two = 2, Tree = 3, Four = 4, R = []                         
[1,2,3,4]

3> [A, _, _, B | C] = List. %  One = 1, B = 4, C = []                        
[1,2,3,4]
```

Jak tego nie robiÄ‡:
```
1> List[1] % ERROR
2> element(1,List) % ERROR
```

W erlangu nie ma typu string
```
1> "abc" = [97,98,99].
"abc"
```

ÅÄ…czenie list:
```
1> [1,2,3,4] ++ [5,6,7,8].
[1,2,3,4,5,6,7,8]

2> "ala " ++ "ma " ++ "kota".
"ala ma kota"
```

PorÃ³wnywanie list:
```
1> [1,2,3,4] = [1,2,3,4]. % OK
[1,2,3,4]

2> [{person, "Jan", "Kowalski"},2,3,4] = [{person, "Jan", "Kowalski"},2,3,4]. % OK
[{person,"Jan","Kowalski"},2,3,4]

3> "abc" = [97,98,99]. % OK
"abc"

4> [2,3,4,1] = [1,2,3,4]. % ERROR
** exception error: no match of right hand side value [1,2,3,4]
```

## Mapy
Mapy w Erlangu to struktura danych przechowujÄ…ca pary kluczâ€“wartoÅ›Ä‡, podobnie jak sÅ‚ownik w Pythonie czy obiekt w JavaScript.
SÅ‚uÅ¼Ä… do przechowywania danych uporzÄ…dkowanych wedÅ‚ug nazwy klucza.

```
1> Student1 = #{name => "Jan", surname => "Kowalski", age => 12}.
#{name => "Jan",surname => "Kowalski",age => 12}

2> Student2 = #{[1,2,3] => "Jan", {20,"Surname"} => "Kowalski", atom => 21}.
#{atom => 21,{20,"Surname"} => "Kowalski",[1,2,3] => "Jan"}
```
WartoÅ›ci i klucze mogÄ… byÄ‡ dowolnego typu.

Pobieranie wartoÅ›ci z mapy
```
1> maps:get(name, Student1).
"Jan"
```

Zmiana mapy:
```
1> NewStudent1 = Student1#{marks => [4,2,3]}.
#{name => "Jan",surname => "Kowalski",age => 12, marks => [4,2,3]}

2> NewStudent2 = Student1#{marks => [5,5,5]}.
#{name => "Jan",surname => "Kowalski",age => 12, marks => [5,5,5]}
```

# Funkcje 4
Wbudowane Funckje (BIFs):  
- `date()  `
- `time()`  
- `length([1,2,3,4,5])`  
- `size({a,b,c})`  
- `atom_to_list(an_atom)`  
- `list_to_tuple([1,2,3,4])`  
- `integer_to_list(2234)`  
- `tuple_to_list({})`  

```
1> fn() -> "Hello World!".
ok

2> add(A,B) -> A+B.
ok
```

## ModuÅ‚y / Pliki BEAM
Funkcie wygodnie pisaÄ‡ w plikach .erl ktÃ³r za pomocÄ… `c(FILE.erl)` moÅ¼na skompilowaÄ‡ do pliku BEAM

1. Erlang kompiluje plik to .beam  

2. Podczas wywoÅ‚ania funkcji `hello:sayHello().` VM szuka moduÅ‚u `hello` z funkcjÄ… `sayHello()` <br>
jeÅ›li istnieje taka potrzeba Erlang moÅ¼e wymieniaÄ‡ moduÅ‚y na Å¼ywo bez zatrzymywania programu.  

3. KaÅ¼dy moduÅ‚ dziaÅ‚a w procesach Erlanga.  
KaÅ¼dy proces ma wÅ‚asny stos i stertÄ™ â€“ nie ma wspÃ³lnej pamiÄ™ci.  
To oznacza, Å¼e moduÅ‚y sÄ… bezpieczne wspÃ³Å‚bieÅ¼nie.  

Wbudowane ModuÅ‚y i ich przydatne funkcje:
1. erlang
 - `spawn/1`, `spawn/3` - Tworzy nowy proces `erlang:spawn(fun() -> io:format("Hi") end).`
 - `self/0`	Zwraca PID bieÅ¼Ä…cego procesu	`erlang:self().`
 - `send/2` (!)	WysyÅ‚a wiadomoÅ›Ä‡ do procesu	`Pid ! {hello, world}.`
 - `now/0` /system_time/0 Pobiera aktualny czas	`erlang:system_time().`
 - `tuple_size/1` Zwraca dÅ‚ugoÅ›Ä‡ tuple `erlang:tuple_size({a,b,c}).`
2. io
- `io:format/2` WyÅ›wietla sformatowany tekst `io:format("Hello ~p~n", [42]).`
- `io:puts/1` WyÅ›wietla tekst z nowÄ… liniÄ… `io:puts("Hello World").`
- `io:get_line/1` Pobiera liniÄ™ od uÅ¼ytkownika `io:get_line("Enter your name: ").`
3. lists
- `lists:map/2` Funkcja mapujÄ…ca `lists:map(fun(X) -> X*2 end, [1,2,3]). â†’ [2,4,6]`
- `lists:filter/2` Filtruje listÄ™ wg predykatu `lists:filter(fun(X) -> X > 2 end, [1,2,3,4]). â†’ [3,4]`
- `lists:reverse/1` Odwraca listÄ™ `lists:reverse([1,2,3]). â†’ [3,2,1]`
- `lists:foldl/3` Fold (redukcja) od lewej `lists:foldl(fun(X,Acc)->X+Acc end,0,[1,2,3]). â†’ 6`
4. string
- `string:to_upper/1` Zamienia na wielkie litery `string:to_upper("hello"). â†’ "HELLO"`
- `string:to_lower/1` Zamienia na maÅ‚e litery `string:to_lower("HELLO"). â†’ "hello"`
- `string:split/2` Dzieli string wg separatora `string:split("a,b,c", ","). â†’ ["a","b","c"]`
5. maps
- `maps:get/2` Pobiera wartoÅ›Ä‡ po kluczu `maps:get(key, #{key => 42}). â†’ 42`
- `maps:put/3` Dodaje/aktualizuje wpis `maps:put(age, 25, #{name => "Alice"}). â†’ #{name => "Alice", age => 25}`
- `maps:remove/2` Usuwa klucz `maps:remove(name, #{name => "Alice", age => 25}). â†’ #{age => 25}`
6. timer
- `timer:sleep/1` Zatrzymuje proces na milisekundy `timer:sleep(1000).`
- `timer:tc/1` Mierzy czas wykonania funkcji `timer:tc(fun() -> lists:sum([1,2,3]) end).`
7. os
- `os:type/0` Typ systemu OS `os:type(). â†’ {unix, linux}`
- `os:getenv/1` Pobiera zmiennÄ… Å›rodowiskowÄ… `os:getenv("HOME").`

Tworzenie moduÅ‚ow:  
ModuÅ‚y moÅ¼na tworzyÄ‡ w plikach .erl

hello.erl :
```
-module(hello).
-export([start/0]).

sayHello() -> 
    io:format("Hello world!~n").
```

kompilacja moduÅ‚u
```
c(hello)
```

wykonanie funkci sayHello
```
1> hello:sayHello().
Hello world!
ok
```

MoÅ¼emy zdefiniowaÄ‡ jak funkcja ma siÄ™ zachowaÄ‡ dla poszczegÃ³Å‚nych argumentÃ³w (Po dajemy ";"!)
```
-module(calculator).
-export([myDiv/2]).

myDiv(N,0) -> io:format("Nie dziel przez 0! BÅ‚Ä…d:~B/0~n", [N]);
myDiv(N,M) -> N/M.
```

### Funkcje prywatne

```
-module(hello).
-export([visitUser/0]).

visitUser() ->
    io:format("Podaj imiÄ™: "),
    UserInput = io:get_line(""),
    UserName = string:trim(UserInput),
    sayHello(UserName).

sayHello(Name) ->
    io:format("Hello ~s!~n", [Name]).
```

```
1> hello:visitUser().
Jan
Hello Jan!
ok

2> hello:sayHello("Jan").
** exception error: undefined function hello:sayHello/1
```

# If i Case
Case i if dziaÅ‚ajÄ… podobie do innych jÄ™zykÃ³w programowania

If:
```
if
    Condition 1 ->
        Action 1;
    Condition 2 ->
        Action 2;
    Condition 3 ->
        Action 3;
    Condition 4 ->
        Action 4
end
```
```
if
    A == 5 ->
        io:format("A == 5~n", []),
        a_equals_5;
    B == 6 ->
        io:format("B == 6~n", []),
        b_equals_6;
    A == 2, B == 3 ->                      %That is A equals 2 and B equals 3
        io:format("A == 2, B == 3~n", []),
        a_equals_2_b_equals_3;
    A == 1 ; B == 7 ->                     %That is A equals 1 or B equals 7
        io:format("A == 1 ; B == 7~n", []),
        a_equals_1_or_b_equals_7
end.
```

Case:
```
case Number of
    0 -> "zero";
    1 -> "jeden";
    _ -> "inna_liczba"
end
```

PorÃ³wnania:
```
	number(X)	- X is a number
	integer(X)	- X is an integer
	float(X)	- X is a float
	atom(X)		- X is an atom
	tuple(X)	- X is a tuple
	list(X)		- X is a list
	
	length(X) == 3	- X is a list of length 3
	size(X) == 2	- X is a tuple of size 2.
	
	X > Y + Z	- X is > Y + Z
	X == Y		- X is equal to Y
    X /= Y		- X is not equal to Y
	X =:= Y		- X is exactly equal to Y
	            (i.e. 1 == 1.0 succeeds but 1 =:= 1.0 fails)
```

### Ä†wiczenia
1. Napisz moduÅ‚ kalkulatora z funkacjami, add/2, subtract/2, multiply/2, divide/2.
2. Napisz moduÅ‚ z funkcjÄ… Fibonacci-ego.
3. Napisz moduÅ‚ z funkcjÄ… sumujÄ…cÄ… wszystkie elementy listy.
4. Napisz moduÅ‚ z funkcja ktÃ³ra przyjmie miesiÄ…c i rok i powie ile dni ma dany miesiÄ…c. (Lata przestÄ™pne to takie ktÃ³re sÄ… podzielne przez 4 i nie dzielÄ… siÄ™ na 100 z wyjÄ…tkiem takich ktÃ³re dzielÄ… siÄ™ przez 400).

# 5 Procesy
Procesy w Erlangu to lekkie, wspÃ³Å‚bieÅ¼ne jednostki wykonawcze, ktÃ³re sÄ… podstawÄ… programowania rÃ³wnolegÅ‚ego i odpornego na bÅ‚Ä™dy w tym jÄ™zyku. KaÅ¼dy proces posiada wÅ‚asnÄ… pamiÄ™Ä‡ i kolejkÄ™ wiadomoÅ›ci, dziÄ™ki czemu nie wspÃ³Å‚dzieli stanu z innymi procesami. Komunikacja miÄ™dzy procesami odbywa siÄ™ asynchronicznie poprzez wysyÅ‚anie i odbieranie wiadomoÅ›ci (ang. message passing).

Procesy w Erlangu:
- sÄ… bardzo lekkie â€“ moÅ¼na uruchomiÄ‡ ich setki tysiÄ™cy,
- sÄ… niezaleÅ¼ne â€“ awaria jednego nie zatrzymuje reszty,
- komunikujÄ… siÄ™ tylko przez wysyÅ‚anie wiadomoÅ›ci,

```
-module(simple_process).
-export([start/0, worker/0]).

start() ->
    Pid = spawn(simple_process, worker, []),
    Pid ! {self(), "Hello from main process"},
    receive
        {Pid, Reply} ->
            io:format("Otrzymano odpowiedÅº: ~p~n", [Reply])
    end.

worker() ->
    receive
        {Sender, Message} ->
            io:format("Worker otrzymaÅ‚: ~p~n", [Message]),
            Sender ! {self(), "DziÄ™ki za wiadomoÅ›Ä‡!"}
    end.
```

```
    receive
        ...
    end.
```
program oczekuje na wiadomoÅ›Ä‡  
`Pid ! {self(), "Hello from main process"},` - self() wysyÅ‚a wiadomoÅ›Ä‡ asynchronicznie do Pid.
